
#+TITLE: LoawMath
#+OPTIONS: num:nil
#+STARTUP: overview

#+begin_src python :results output
import numpy as np

X = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

U, S, Uh = np.linalg.svd(X, full_matrices=False)
print(U)
print(S)
print(Uh)
print("*********")
print(U[:, :1])
print(S[:1])
print(Uh[:1, :])
A = U[:, :1] @ np.diag(S[:1])
B = Uh[:1, :]

X_approx = A@B
print(X_approx)
#+end_src

#+RESULTS:
#+begin_example
[[-0.21483724  0.88723069  0.40824829]
 [-0.52058739  0.24964395 -0.81649658]
 [-0.82633754 -0.38794278  0.40824829]]
[1.68481034e+01 1.06836951e+00 3.33475287e-16]
[[-0.47967118 -0.57236779 -0.66506441]
 [-0.77669099 -0.07568647  0.62531805]
 [-0.40824829  0.81649658 -0.40824829]]
,*********
[[-0.21483724]
 [-0.52058739]
 [-0.82633754]]
[16.84810335]
[[-0.47967118 -0.57236779 -0.66506441]]
[[1.73621779 2.07174246 2.40726714]
 [4.2071528  5.02018649 5.83322018]
 [6.6780878  7.96863051 9.25917322]]
#+end_example
